blog/todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TODOs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<h1 class="title">TODOs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7cbb3c">1. OKR</a>
<ul>
<li><a href="#orgf0d27de">1.1. 预备</a>
<ul>
<li><a href="#org298b288">1.1.1. 视频 live mqtt 迁移</a></li>
<li><a href="#org8dd3d8b">1.1.2. live 敏感数据迁移</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge8e4828">2. LIVE sla，涉及新 live rpc 迁移修改</a></li>
<li><a href="#org11e7a3a">3. oncall 机器人</a></li>
<li><a href="#org794d483">4. 老 live 迁移</a></li>
<li><a href="#org680ee1e">5. 新 live 爬虫问题</a></li>
<li><a href="#orga05670d">6. publication 后台结算迁移，调度任务整理</a></li>
<li><a href="#org2b8d50f">7. <span class="done DONE">DONE</span> 推广页 button 加字段 <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-26 Thu&gt;</span></span></a></li>
<li><a href="#orgb544dbb">8. <span class="done DONE">DONE</span> 后台优化三期</a>
<ul>
<li><a href="#org2599163">8.1. <span class="done DONE">DONE</span> 会员推荐页</a>
<ul>
<li><a href="#org4608a66">8.1.1. <span class="done DONE">DONE</span> 排序，筛选（前端处理）0d</a></li>
<li><a href="#orgf7ca659">8.1.2. <span class="todo TODO">TODO</span> 增加模块创建人, 最新修改人，创建时间，最新修改时间 1d</a></li>
<li><a href="#org4404169">8.1.3. <span class="done DONE">DONE</span> 增加排序规则：权重 + 创建时间倒叙 0d</a></li>
<li><a href="#org2f9761a">8.1.4. <code>sku_id</code> =&gt; <code>business_id</code> 1d</a></li>
</ul>
</li>
<li><a href="#orgbaf90e7">8.2. <span class="done DONE">DONE</span> sku 专题和推广活动</a>
<ul>
<li><a href="#org7c6d717">8.2.1. <span class="done DONE">DONE</span> 精选专题单增加跳转链接和图片 1d</a></li>
<li><a href="#orgde9b377">8.2.2. <span class="done DONE">DONE</span> 精选专题多/单 <code>sku_id</code> =&gt; <code>business_id</code> 0.5d</a></li>
<li><a href="#org5602900">8.2.3. <span class="todo TODO">TODO</span> 模块配置列表去掉一些模块 0d</a></li>
</ul>
</li>
<li><a href="#org1267e97">8.3. <span class="done DONE">DONE</span> 线下活动复制。榜单复制 <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-26 Thu&gt;</span></span></a>
<ul>
<li><a href="#org8b54b3e">8.3.1. <span class="done DONE">DONE</span> 榜单复制 0.5 d</a></li>
<li><a href="#orge707ef8">8.3.2. <span class="done DONE">DONE</span> 线下活动复制 0.5 d</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9a497c2">9. <span class="done DONE">DONE</span> 分期上线 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-07 Tue&gt;</span></span></a>
<ul>
<li><a href="#org7fc1529">9.1. <span class="done DONE">DONE</span> 一次性上线公开时判断期数和总期数</a></li>
<li><a href="#org1e07097">9.2. <span class="done DONE">DONE</span> 私家课编辑页和盐选专栏编辑页增加修改分期上线功能 bug notify!</a>
<ul>
<li><a href="#orgbb12878">9.2.1. <code>is_staged</code> 总期数和总时长不能为0，album 的 schema 有验证，不是很重要</a></li>
<li><a href="#orgaf7744e">9.2.2. <code>is_staged</code> 和 <code>is_serial</code> 不能同时为 True，schema 中应该有 validate</a></li>
<li><a href="#orgbb7b801">9.2.3. 什么 VipFreeUploadingAlbumController 里面有加入 <code>is_staged</code> 为 True 的数据，但是只有一个 rpc 用到，这个 rpc 目前没有 qps，暂时不管了</a></li>
<li><a href="#orgfe79759">9.2.4. <code>is_staged</code> = True, 可以， 为 False 时如果 <code>is_public=True</code> 则 <code>section_count</code> assert equal <code>update_section_count</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0605193">10. <span class="done DONE">DONE</span> 疫情活动页</a>
<ul>
<li><a href="#orgab4f75f">10.1. <span class="done DONE">DONE</span> 对接直播 cell</a>
<ul>
<li><a href="#orgf3ee08e">10.1.1. <span class="done DONE">DONE</span> P0 推广活动增加 cell 后台前台 1d</a></li>
<li><a href="#org148194a">10.1.2. <span class="done DONE">DONE</span> P0 预约接口 0.5d</a></li>
<li><a href="#org226d375">10.1.3. <span class="done DONE">DONE</span> P1 私信 push 1d</a></li>
<li><a href="#org62bb769">10.1.4. <span class="done DONE">DONE</span> P1 锚点待定</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org528a739">11. <span class="done DONE">DONE</span> 教育联运频道页 10.5d + 3d</a>
<ul>
<li><a href="#org3efd0a2">11.1. <span class="done DONE">DONE</span> 创建数据库 0.5d</a></li>
<li><a href="#org01011f5">11.2. <span class="todo TODO">TODO</span> Header 1d</a>
<ul>
<li><a href="#org07a75bd">11.2.1. <span class="todo TODO">TODO</span> 后台 1d</a></li>
</ul>
</li>
<li><a href="#orgd445b9d">11.3. <span class="todo TODO">TODO</span> 推荐tab 4d</a>
<ul>
<li><a href="#org12be18f">11.3.1. <span class="todo TODO">TODO</span> 逻辑+接口 2d</a></li>
<li><a href="#org3821ab2">11.3.2. <span class="todo TODO">TODO</span> 后台 2d</a></li>
</ul>
</li>
<li><a href="#org987cf8a">11.4. <span class="todo TODO">TODO</span> 各种模块 5d</a>
<ul>
<li><a href="#orgbfde562">11.4.1. <span class="todo TODO">TODO</span> banner 模块 1d</a></li>
<li><a href="#org47bfce8">11.4.2. <span class="todo TODO">TODO</span> 问答模块 1d</a></li>
<li><a href="#org3fd70ce">11.4.3. <span class="todo TODO">TODO</span> 直播模块 1d</a></li>
<li><a href="#org720b288">11.4.4. <span class="todo TODO">TODO</span> 名师专区模块 1d</a></li>
<li><a href="#orgad95eb3">11.4.5. <span class="todo TODO">TODO</span> 单列sku模块 1d</a></li>
</ul>
</li>
<li><a href="#org416be15">11.5. <span class="todo TODO">TODO</span> 联调 3d</a>
<ul>
<li><a href="#org6dd9e80">11.5.1. <span class="todo TODO">TODO</span> 多列sku模块 1d xxx</a></li>
<li><a href="#orga6e4777">11.5.2. <span class="todo TODO">TODO</span> 热度 2d xxx</a></li>
<li><a href="#orgf5945cb">11.5.3. <span class="todo TODO">TODO</span> 目标 2d</a></li>
<li><a href="#org4e033bd">11.5.4. <span class="todo TODO">TODO</span> 关注接口 0.5d</a></li>
</ul>
</li>
<li><a href="#org84a2658">11.6. <span class="done DONE">DONE</span> 实操</a>
<ul>
<li><a href="#orgcf5aae5">11.6.1. <span class="done DONE">DONE</span> controller model schema handler 框架</a></li>
<li><a href="#org346d7ed">11.6.2. <span class="done DONE">DONE</span> banner module + test</a></li>
<li><a href="#org766c568">11.6.3. <span class="done DONE">DONE</span> qa module + test</a></li>
<li><a href="#org51a052c">11.6.4. <span class="done DONE">DONE</span> cache</a></li>
<li><a href="#org53363d8">11.6.5. <span class="done DONE">DONE</span> 异常捕获</a></li>
<li><a href="#org8ba76d9">11.6.6. <span class="todo TODO">TODO</span> log</a></li>
<li><a href="#orgaf4c54d">11.6.7. <span class="todo TODO">TODO</span> 代码优化</a></li>
<li><a href="#orgb68f7b5">11.6.8. <span class="done DONE">DONE</span> 直播预告 module + test</a></li>
<li><a href="#org0b7c4db">11.6.9. <span class="done DONE">DONE</span> 名人专区 module + test</a></li>
<li><a href="#org075ba8f">11.6.10. <span class="todo TODO">TODO</span> Header 接口</a></li>
<li><a href="#org93beca6">11.6.11. <span class="todo TODO">TODO</span> 模块后台&#x2026;</a></li>
<li><a href="#orgfdb2117">11.6.12. <span class="todo TODO">TODO</span> 关注接口</a></li>
<li><a href="#org9b1a7db">11.6.13. <span class="todo TODO">TODO</span> 预约直播接口</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org644bf60">12. <span class="done DONE">DONE</span> 留资</a>
<ul>
<li><a href="#orgc74b27b">12.1. 问题：1. 同步</a></li>
<li><a href="#orgd9abf8c">12.2. 确认接口失败策略，加密文档</a></li>
<li><a href="#org86bee5e">12.3. <span class="done DONE">DONE</span> remix 后台添加「免费留资」字段并同步 sku 底栏</a></li>
<li><a href="#orgdf5a627">12.4. <span class="done DONE">DONE</span> 上传手机号和课程信息接口，education?</a>
<ul>
<li><a href="#org3f4a117">12.4.1. <span class="done DONE">DONE</span> 手机号校验</a></li>
<li><a href="#orgb41f27b">12.4.2. <span class="done DONE">DONE</span> 保存 bolzano</a></li>
<li><a href="#orgcf93acc">12.4.3. <span class="done DONE">DONE</span> 建表</a></li>
</ul>
</li>
<li><a href="#orga168c98">12.5. <span class="done DONE">DONE</span> 同步用户信息到第三方</a></li>
</ul>
</li>
<li><a href="#org93abbfa">13. <span class="done DONE">DONE</span> 绑定优惠券</a>
<ul>
<li><a href="#org450ced6">13.1. <span class="done DONE">DONE</span> 后台绑定 channelkey 1d</a></li>
<li><a href="#org0ef7ee4">13.2. <span class="done DONE">DONE</span> kafka 接口，发优惠券+私信+短信+存 1.5d</a></li>
<li><a href="#orge6ab076">13.3. <span class="done DONE">DONE</span> 联调 1d</a></li>
</ul>
</li>
<li><a href="#orgb5bedc8">14. <span class="done DONE">DONE</span> 教育联运退款</a>
<ul>
<li><a href="#orgb17bf54">14.1. <span class="done DONE">DONE</span> 创建退款接口-退款退货，退款是否支持部分退款？ 1.5d</a></li>
<li><a href="#org1c6dd34">14.2. <span class="done DONE">DONE</span> 退款列表接口-没啥说的 0.5d</a></li>
<li><a href="#orga92e691">14.3. <span class="done DONE">DONE</span> 页面权限配置 0.5d</a></li>
<li><a href="#org662fa65">14.4. <span class="done DONE">DONE</span> 快页面 1.5d</a></li>
</ul>
</li>
<li><a href="#orga8c1868">15. <span class="done DONE">DONE</span> multimerge</a>
<ul>
<li><a href="#orge45b7a4">15.1. <span class="todo TODO">TODO</span> 堆长度加字段记录，不要去实时计算</a></li>
<li><a href="#org1897c8f">15.2. <span class="todo TODO">TODO</span> 计算父子 index 不要用 * /，用 &gt;&gt;</a></li>
<li><a href="#org795285f">15.3. <span class="todo TODO">TODO</span> for 循环找 node 的 index 是犯罪行为！</a></li>
<li><a href="#orgc3a19ea">15.4. <span class="todo TODO">TODO</span> push 操作不需要重新 make heap</a></li>
</ul>
</li>
<li><a href="#orgb9ef19a">16. <span class="todo TODO">TODO</span> 验证微信已购 sku 5d</a>
<ul>
<li><a href="#orgf976dd3">16.1. <span class="todo TODO">TODO</span> 前台接口 1d+历史数据</a></li>
<li><a href="#org3630196">16.2. <span class="todo TODO">TODO</span> 微信登陆 1d</a></li>
<li><a href="#org100e61e">16.3. <span class="todo TODO">TODO</span> 后台 3d</a>
<ul>
<li><a href="#org9badffe">16.3.1. <span class="done DONE">DONE</span> 对接商户网管 0.5d</a></li>
<li><a href="#org9a19e0a">16.3.2. <span class="todo TODO">TODO</span> 对接商户网管内网</a></li>
<li><a href="#orgb54ec54">16.3.3. <span class="todo TODO">TODO</span> 「商户」替换合作方 1.5d</a></li>
<li><a href="#org0b1672d">16.3.4. <span class="todo TODO">TODO</span> 后台接口（验证，列表） 1d</a></li>
</ul>
</li>
<li><a href="#org3fc80ad">16.4. <span class="todo TODO">TODO</span> 联调 2d</a></li>
</ul>
</li>
<li><a href="#orgd40e5a2">17. <span class="todo TODO">TODO</span> 业务指标监控</a></li>
<li><a href="#org658eb7b">18. <span class="done DONE">DONE</span> 分类+合作方名称</a></li>
<li><a href="#orgb31d4bb">19. <span class="todo TODO">TODO</span> 白板调研</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7cbb3c" class="outline-2">
<h2 id="orgc7cbb3c"><span class="section-number-2">1</span> OKR</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf0d27de" class="outline-3">
<h3 id="orgf0d27de"><span class="section-number-3">1.1</span> 预备</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org298b288" class="outline-4">
<h4 id="org298b288"><span class="section-number-4">1.1.1</span> 视频 live mqtt 迁移</h4>
</div>
<div id="outline-container-org8dd3d8b" class="outline-4">
<h4 id="org8dd3d8b"><span class="section-number-4">1.1.2</span> live 敏感数据迁移</h4>
</div>
</div>
</div>

<div id="outline-container-orge8e4828" class="outline-2">
<h2 id="orge8e4828"><span class="section-number-2">2</span> LIVE sla，涉及新 live rpc 迁移修改</h2>
</div>
<div id="outline-container-org11e7a3a" class="outline-2">
<h2 id="org11e7a3a"><span class="section-number-2">3</span> oncall 机器人</h2>
</div>
<div id="outline-container-org794d483" class="outline-2">
<h2 id="org794d483"><span class="section-number-2">4</span> 老 live 迁移</h2>
</div>
<div id="outline-container-org680ee1e" class="outline-2">
<h2 id="org680ee1e"><span class="section-number-2">5</span> 新 live 爬虫问题</h2>
</div>
<div id="outline-container-orga05670d" class="outline-2">
<h2 id="orga05670d"><span class="section-number-2">6</span> publication 后台结算迁移，调度任务整理</h2>
</div>
<div id="outline-container-org2b8d50f" class="outline-2">
<h2 id="org2b8d50f"><span class="section-number-2">7</span> <span class="done DONE">DONE</span> 推广页 button 加字段 <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-26 Thu&gt;</span></span></h2>
</div>
<div id="outline-container-orgb544dbb" class="outline-2">
<h2 id="orgb544dbb"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> 后台优化三期</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org2599163" class="outline-3">
<h3 id="org2599163"><span class="section-number-3">8.1</span> <span class="done DONE">DONE</span> 会员推荐页</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org4608a66" class="outline-4">
<h4 id="org4608a66"><span class="section-number-4">8.1.1</span> <span class="done DONE">DONE</span> 排序，筛选（前端处理）0d</h4>
</div>
<div id="outline-container-orgf7ca659" class="outline-4">
<h4 id="orgf7ca659"><span class="section-number-4">8.1.2</span> <span class="todo TODO">TODO</span> 增加模块创建人, 最新修改人，创建时间，最新修改时间 1d</h4>
</div>
<div id="outline-container-org4404169" class="outline-4">
<h4 id="org4404169"><span class="section-number-4">8.1.3</span> <span class="done DONE">DONE</span> 增加排序规则：权重 + 创建时间倒叙 0d</h4>
</div>
<div id="outline-container-org2f9761a" class="outline-4">
<h4 id="org2f9761a"><span class="section-number-4">8.1.4</span> <code>sku_id</code> =&gt; <code>business_id</code> 1d</h4>
</div>
</div>
<div id="outline-container-orgbaf90e7" class="outline-3">
<h3 id="orgbaf90e7"><span class="section-number-3">8.2</span> <span class="done DONE">DONE</span> sku 专题和推广活动</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org7c6d717" class="outline-4">
<h4 id="org7c6d717"><span class="section-number-4">8.2.1</span> <span class="done DONE">DONE</span> 精选专题单增加跳转链接和图片 1d</h4>
</div>
<div id="outline-container-orgde9b377" class="outline-4">
<h4 id="orgde9b377"><span class="section-number-4">8.2.2</span> <span class="done DONE">DONE</span> 精选专题多/单 <code>sku_id</code> =&gt; <code>business_id</code> 0.5d</h4>
</div>
<div id="outline-container-org5602900" class="outline-4">
<h4 id="org5602900"><span class="section-number-4">8.2.3</span> <span class="todo TODO">TODO</span> 模块配置列表去掉一些模块 0d</h4>
</div>
</div>
<div id="outline-container-org1267e97" class="outline-3">
<h3 id="org1267e97"><span class="section-number-3">8.3</span> <span class="done DONE">DONE</span> 线下活动复制。榜单复制 <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-26 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org8b54b3e" class="outline-4">
<h4 id="org8b54b3e"><span class="section-number-4">8.3.1</span> <span class="done DONE">DONE</span> 榜单复制 0.5 d</h4>
</div>
<div id="outline-container-orge707ef8" class="outline-4">
<h4 id="orge707ef8"><span class="section-number-4">8.3.2</span> <span class="done DONE">DONE</span> 线下活动复制 0.5 d</h4>
</div>
</div>
</div>
<div id="outline-container-org9a497c2" class="outline-2">
<h2 id="org9a497c2"><span class="section-number-2">9</span> <span class="done DONE">DONE</span> 分期上线 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-07 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-9">
</div>
