blog/todo.html
<div id="outline-container-org7fc1529" class="outline-3">
<h3 id="org7fc1529"><span class="section-number-3">9.1</span> <span class="done DONE">DONE</span> 一次性上线公开时判断期数和总期数</h3>
<div class="outline-text-3" id="text-9-1">
</div>
</div>
<div id="outline-container-org1e07097" class="outline-3">
<h3 id="org1e07097"><span class="section-number-3">9.2</span> <span class="done DONE">DONE</span> 私家课编辑页和盐选专栏编辑页增加修改分期上线功能 bug notify!</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgbb12878" class="outline-4">
<h4 id="orgbb12878"><span class="section-number-4">9.2.1</span> <code>is_staged</code> 总期数和总时长不能为0，album 的 schema 有验证，不是很重要</h4>
</div>
<div id="outline-container-orgaf7744e" class="outline-4">
<h4 id="orgaf7744e"><span class="section-number-4">9.2.2</span> <code>is_staged</code> 和 <code>is_serial</code> 不能同时为 True，schema 中应该有 validate</h4>
</div>
<div id="outline-container-orgbb7b801" class="outline-4">
<h4 id="orgbb7b801"><span class="section-number-4">9.2.3</span> 什么 VipFreeUploadingAlbumController 里面有加入 <code>is_staged</code> 为 True 的数据，但是只有一个 rpc 用到，这个 rpc 目前没有 qps，暂时不管了</h4>
</div>
<div id="outline-container-orgfe79759" class="outline-4">
<h4 id="orgfe79759"><span class="section-number-4">9.2.4</span> <code>is_staged</code> = True, 可以， 为 False 时如果 <code>is_public=True</code> 则 <code>section_count</code> assert equal <code>update_section_count</code></h4>
</div>
</div>
</div>
<div id="outline-container-org0605193" class="outline-2">
<h2 id="org0605193"><span class="section-number-2">10</span> <span class="done DONE">DONE</span> 疫情活动页</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgab4f75f" class="outline-3">
<h3 id="orgab4f75f"><span class="section-number-3">10.1</span> <span class="done DONE">DONE</span> 对接直播 cell</h3>
<div class="outline-text-3" id="text-10-1">
<ol class="org-ol">
<li>直播信息 rpc 接口</li>
<li>直播预约 rpc 接口</li>
<li>后台增加直播 cell 存储和前台展示</li>

<li>前端获取直播 http 接口 0d</li>
<li>创建和更新时增加直播cell支持，~raw content~ 不动，module data 用来存放直播数据 0.5d</li>
<li>前台渲染, 直播 rpc，直播专用 schema 1d，直播预约状态 rpc</li>
<li>预约接口，保存，发私信，调用直播预约rpc 0.5d</li>
</ol>
</div>
<div id="outline-container-orgf3ee08e" class="outline-4">
<h4 id="orgf3ee08e"><span class="section-number-4">10.1.1</span> <span class="done DONE">DONE</span> P0 推广活动增加 cell 后台前台 1d</h4>
<div class="outline-text-4" id="text-10-1-1">
</div>
</div>
<div id="outline-container-org148194a" class="outline-4">
<h4 id="org148194a"><span class="section-number-4">10.1.2</span> <span class="done DONE">DONE</span> P0 预约接口 0.5d</h4>
<div class="outline-text-4" id="text-10-1-2">
</div>
</div>
<div id="outline-container-org226d375" class="outline-4">
<h4 id="org226d375"><span class="section-number-4">10.1.3</span> <span class="done DONE">DONE</span> P1 私信 push 1d</h4>
<div class="outline-text-4" id="text-10-1-3">
</div>
</div>
<div id="outline-container-org62bb769" class="outline-4">
<h4 id="org62bb769"><span class="section-number-4">10.1.4</span> <span class="done DONE">DONE</span> P1 锚点待定</h4>
<div class="outline-text-4" id="text-10-1-4">
</div>
</div>
</div>
</div>

<div id="outline-container-org528a739" class="outline-2">
<h2 id="org528a739"><span class="section-number-2">11</span> <span class="done DONE">DONE</span> 教育联运频道页 10.5d + 3d</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org3efd0a2" class="outline-3">
<h3 id="org3efd0a2"><span class="section-number-3">11.1</span> <span class="done DONE">DONE</span> 创建数据库 0.5d</h3>
<div class="outline-text-3" id="text-11-1">
</div>
</div>
<div id="outline-container-org01011f5" class="outline-3">
<h3 id="org01011f5"><span class="section-number-3">11.2</span> <span class="todo TODO">TODO</span> Header 1d</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-org07a75bd" class="outline-4">
<h4 id="org07a75bd"><span class="section-number-4">11.2.1</span> <span class="todo TODO">TODO</span> 后台 1d</h4>
</div>
</div>
<div id="outline-container-orgd445b9d" class="outline-3">
<h3 id="orgd445b9d"><span class="section-number-3">11.3</span> <span class="todo TODO">TODO</span> 推荐tab 4d</h3>
<div class="outline-text-3" id="text-11-3">
</div>
<div id="outline-container-org12be18f" class="outline-4">
<h4 id="org12be18f"><span class="section-number-4">11.3.1</span> <span class="todo TODO">TODO</span> 逻辑+接口 2d</h4>
</div>
<div id="outline-container-org3821ab2" class="outline-4">
<h4 id="org3821ab2"><span class="section-number-4">11.3.2</span> <span class="todo TODO">TODO</span> 后台 2d</h4>
</div>
</div>
<div id="outline-container-org987cf8a" class="outline-3">
<h3 id="org987cf8a"><span class="section-number-3">11.4</span> <span class="todo TODO">TODO</span> 各种模块 5d</h3>
<div class="outline-text-3" id="text-11-4">
</div>
<div id="outline-container-orgbfde562" class="outline-4">
<h4 id="orgbfde562"><span class="section-number-4">11.4.1</span> <span class="todo TODO">TODO</span> banner 模块 1d</h4>
</div>
<div id="outline-container-org47bfce8" class="outline-4">
<h4 id="org47bfce8"><span class="section-number-4">11.4.2</span> <span class="todo TODO">TODO</span> 问答模块 1d</h4>
</div>
<div id="outline-container-org3fd70ce" class="outline-4">
<h4 id="org3fd70ce"><span class="section-number-4">11.4.3</span> <span class="todo TODO">TODO</span> 直播模块 1d</h4>
</div>
<div id="outline-container-org720b288" class="outline-4">
<h4 id="org720b288"><span class="section-number-4">11.4.4</span> <span class="todo TODO">TODO</span> 名师专区模块 1d</h4>
</div>
<div id="outline-container-orgad95eb3" class="outline-4">
<h4 id="orgad95eb3"><span class="section-number-4">11.4.5</span> <span class="todo TODO">TODO</span> 单列sku模块 1d</h4>
</div>
</div>
<div id="outline-container-org416be15" class="outline-3">
<h3 id="org416be15"><span class="section-number-3">11.5</span> <span class="todo TODO">TODO</span> 联调 3d</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-org6dd9e80" class="outline-4">
<h4 id="org6dd9e80"><span class="section-number-4">11.5.1</span> <span class="todo TODO">TODO</span> 多列sku模块 1d xxx</h4>
</div>




<div id="outline-container-orga6e4777" class="outline-4">
<h4 id="orga6e4777"><span class="section-number-4">11.5.2</span> <span class="todo TODO">TODO</span> 热度 2d xxx</h4>
<div class="outline-text-4" id="text-11-5-2">
</div>
<ol class="org-ol">
<li><a id="orgf542599"></a><span class="todo TODO">TODO</span> 创建离线任务 1d<br /></li>
<li><a id="org292cf28"></a><span class="todo TODO">TODO</span> 热度计算逻辑和接口 1d<br /></li>
</ol>
</div>
<div id="outline-container-orgf5945cb" class="outline-4">
<h4 id="orgf5945cb"><span class="section-number-4">11.5.3</span> <span class="todo TODO">TODO</span> 目标 2d</h4>
<div class="outline-text-4" id="text-11-5-3">
</div>
<ol class="org-ol">
<li><a id="org59ffdac"></a><span class="todo TODO">TODO</span> 设置目标接口 1d  xxx<br /></li>
<li><a id="org9fd6d91"></a><span class="todo TODO">TODO</span> 目标文案解析 1d  xxx<br /></li>
</ol>
</div>
<div id="outline-container-org4e033bd" class="outline-4">
<h4 id="org4e033bd"><span class="section-number-4">11.5.4</span> <span class="todo TODO">TODO</span> 关注接口 0.5d</h4>
</div>
</div>
<div id="outline-container-org84a2658" class="outline-3">
<h3 id="org84a2658"><span class="section-number-3">11.6</span> <span class="done DONE">DONE</span> 实操</h3>
<div class="outline-text-3" id="text-11-6">
</div>
<div id="outline-container-orgcf5aae5" class="outline-4">
<h4 id="orgcf5aae5"><span class="section-number-4">11.6.1</span> <span class="done DONE">DONE</span> controller model schema handler 框架</h4>
<div class="outline-text-4" id="text-11-6-1">
</div>
</div>
<div id="outline-container-org346d7ed" class="outline-4">
<h4 id="org346d7ed"><span class="section-number-4">11.6.2</span> <span class="done DONE">DONE</span> banner module + test</h4>
<div class="outline-text-4" id="text-11-6-2">
</div>
</div>
<div id="outline-container-org766c568" class="outline-4">
<h4 id="org766c568"><span class="section-number-4">11.6.3</span> <span class="done DONE">DONE</span> qa module + test</h4>
<div class="outline-text-4" id="text-11-6-3">
</div>
</div>
<div id="outline-container-org51a052c" class="outline-4">
<h4 id="org51a052c"><span class="section-number-4">11.6.4</span> <span class="done DONE">DONE</span> cache</h4>
<div class="outline-text-4" id="text-11-6-4">
</div>
</div>
<div id="outline-container-org53363d8" class="outline-4">
<h4 id="org53363d8"><span class="section-number-4">11.6.5</span> <span class="done DONE">DONE</span> 异常捕获</h4>
<div class="outline-text-4" id="text-11-6-5">
</div>
</div>
<div id="outline-container-org8ba76d9" class="outline-4">
<h4 id="org8ba76d9"><span class="section-number-4">11.6.6</span> <span class="todo TODO">TODO</span> log</h4>
</div>
<div id="outline-container-orgaf4c54d" class="outline-4">
<h4 id="orgaf4c54d"><span class="section-number-4">11.6.7</span> <span class="todo TODO">TODO</span> 代码优化</h4>
</div>
<div id="outline-container-orgb68f7b5" class="outline-4">
<h4 id="orgb68f7b5"><span class="section-number-4">11.6.8</span> <span class="done DONE">DONE</span> 直播预告 module + test</h4>
<div class="outline-text-4" id="text-11-6-8">
</div>
</div>
<div id="outline-container-org0b7c4db" class="outline-4">
<h4 id="org0b7c4db"><span class="section-number-4">11.6.9</span> <span class="done DONE">DONE</span> 名人专区 module + test</h4>
<div class="outline-text-4" id="text-11-6-9">
</div>
</div>
<div id="outline-container-org075ba8f" class="outline-4">
<h4 id="org075ba8f"><span class="section-number-4">11.6.10</span> <span class="todo TODO">TODO</span> Header 接口</h4>
</div>
<div id="outline-container-org93beca6" class="outline-4">
<h4 id="org93beca6"><span class="section-number-4">11.6.11</span> <span class="todo TODO">TODO</span> 模块后台&#x2026;</h4>
</div>
<div id="outline-container-orgfdb2117" class="outline-4">
<h4 id="orgfdb2117"><span class="section-number-4">11.6.12</span> <span class="todo TODO">TODO</span> 关注接口</h4>
</div>
<div id="outline-container-org9b1a7db" class="outline-4">
<h4 id="org9b1a7db"><span class="section-number-4">11.6.13</span> <span class="todo TODO">TODO</span> 预约直播接口</h4>
</div>
</div>
</div>
<div id="outline-container-org644bf60" class="outline-2">
<h2 id="org644bf60"><span class="section-number-2">12</span> <span class="done DONE">DONE</span> 留资</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgc74b27b" class="outline-3">
<h3 id="orgc74b27b"><span class="section-number-3">12.1</span> 问题：1. 同步</h3>
</div>
<div id="outline-container-orgd9abf8c" class="outline-3">
<h3 id="orgd9abf8c"><span class="section-number-3">12.2</span> 确认接口失败策略，加密文档</h3>
</div>
<div id="outline-container-org86bee5e" class="outline-3">
<h3 id="org86bee5e"><span class="section-number-3">12.3</span> <span class="done DONE">DONE</span> remix 后台添加「免费留资」字段并同步 sku 底栏</h3>
<div class="outline-text-3" id="text-12-3">
</div>
</div>
<div id="outline-container-orgdf5a627" class="outline-3">
<h3 id="orgdf5a627"><span class="section-number-3">12.4</span> <span class="done DONE">DONE</span> 上传手机号和课程信息接口，education?</h3>
<div class="outline-text-3" id="text-12-4">
</div>
<div id="outline-container-org3f4a117" class="outline-4">
<h4 id="org3f4a117"><span class="section-number-4">12.4.1</span> <span class="done DONE">DONE</span> 手机号校验</h4>
<div class="outline-text-4" id="text-12-4-1">
</div>
</div>
<div id="outline-container-orgb41f27b" class="outline-4">
<h4 id="orgb41f27b"><span class="section-number-4">12.4.2</span> <span class="done DONE">DONE</span> 保存 bolzano</h4>
<div class="outline-text-4" id="text-12-4-2">
</div>
</div>
<div id="outline-container-orgcf93acc" class="outline-4">
<h4 id="orgcf93acc"><span class="section-number-4">12.4.3</span> <span class="done DONE">DONE</span> 建表</h4>
<div class="outline-text-4" id="text-12-4-3">
<ul class="org-ul">
<li>课程 id， sku id</li>
<li>合作方 enum</li>
<li>用户提交手机号</li>
<li>用户提交时间 <code>created_at</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga168c98" class="outline-3">
<h3 id="orga168c98"><span class="section-number-3">12.5</span> <span class="done DONE">DONE</span> 同步用户信息到第三方</h3>
<div class="outline-text-3" id="text-12-5">
</div>
</div>
</div>
<div id="outline-container-org93abbfa" class="outline-2">
<h2 id="org93abbfa"><span class="section-number-2">13</span> <span class="done DONE">DONE</span> 绑定优惠券</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org450ced6" class="outline-3">
<h3 id="org450ced6"><span class="section-number-3">13.1</span> <span class="done DONE">DONE</span> 后台绑定 channelkey 1d</h3>
<div class="outline-text-3" id="text-13-1">
</div>
</div>
<div id="outline-container-org0ef7ee4" class="outline-3">
<h3 id="org0ef7ee4"><span class="section-number-3">13.2</span> <span class="done DONE">DONE</span> kafka 接口，发优惠券+私信+短信+存 1.5d</h3>
<div class="outline-text-3" id="text-13-2">
</div>
</div>
