blog/todo.html
<div id="outline-container-orge6ab076" class="outline-3">
<h3 id="orge6ab076"><span class="section-number-3">13.3</span> <span class="done DONE">DONE</span> 联调 1d</h3>
<div class="outline-text-3" id="text-13-3">
</div>
</div>
</div>
<div id="outline-container-orgb5bedc8" class="outline-2">
<h2 id="orgb5bedc8"><span class="section-number-2">14</span> <span class="done DONE">DONE</span> 教育联运退款</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgb17bf54" class="outline-3">
<h3 id="orgb17bf54"><span class="section-number-3">14.1</span> <span class="done DONE">DONE</span> 创建退款接口-退款退货，退款是否支持部分退款？ 1.5d</h3>
<div class="outline-text-3" id="text-14-1">
</div>
</div>
<div id="outline-container-org1c6dd34" class="outline-3">
<h3 id="org1c6dd34"><span class="section-number-3">14.2</span> <span class="done DONE">DONE</span> 退款列表接口-没啥说的 0.5d</h3>
<div class="outline-text-3" id="text-14-2">
</div>
</div>
<div id="outline-container-orga92e691" class="outline-3">
<h3 id="orga92e691"><span class="section-number-3">14.3</span> <span class="done DONE">DONE</span> 页面权限配置 0.5d</h3>
<div class="outline-text-3" id="text-14-3">
</div>
</div>
<div id="outline-container-org662fa65" class="outline-3">
<h3 id="org662fa65"><span class="section-number-3">14.4</span> <span class="done DONE">DONE</span> 快页面 1.5d</h3>
<div class="outline-text-3" id="text-14-4">
</div>
</div>
</div>
<div id="outline-container-orga8c1868" class="outline-2">
<h2 id="orga8c1868"><span class="section-number-2">15</span> <span class="done DONE">DONE</span> multimerge</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orge45b7a4" class="outline-3">
<h3 id="orge45b7a4"><span class="section-number-3">15.1</span> <span class="todo TODO">TODO</span> 堆长度加字段记录，不要去实时计算</h3>
</div>
<div id="outline-container-org1897c8f" class="outline-3">
<h3 id="org1897c8f"><span class="section-number-3">15.2</span> <span class="todo TODO">TODO</span> 计算父子 index 不要用 * /，用 &gt;&gt;</h3>
</div>
<div id="outline-container-org795285f" class="outline-3">
<h3 id="org795285f"><span class="section-number-3">15.3</span> <span class="todo TODO">TODO</span> for 循环找 node 的 index 是犯罪行为！</h3>
</div>
<div id="outline-container-orgc3a19ea" class="outline-3">
<h3 id="orgc3a19ea"><span class="section-number-3">15.4</span> <span class="todo TODO">TODO</span> push 操作不需要重新 make heap</h3>
</div>
</div>
<div id="outline-container-orgb9ef19a" class="outline-2">
<h2 id="orgb9ef19a"><span class="section-number-2">16</span> <span class="todo TODO">TODO</span> 验证微信已购 sku 5d</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgf976dd3" class="outline-3">
<h3 id="orgf976dd3"><span class="section-number-3">16.1</span> <span class="todo TODO">TODO</span> 前台接口 1d+历史数据</h3>
</div>
<div id="outline-container-org3630196" class="outline-3">
<h3 id="org3630196"><span class="section-number-3">16.2</span> <span class="todo TODO">TODO</span> 微信登陆 1d</h3>
</div>
<div id="outline-container-org100e61e" class="outline-3">
<h3 id="org100e61e"><span class="section-number-3">16.3</span> <span class="todo TODO">TODO</span> 后台 3d</h3>
<div class="outline-text-3" id="text-16-3">
</div>
<div id="outline-container-org9badffe" class="outline-4">
<h4 id="org9badffe"><span class="section-number-4">16.3.1</span> <span class="done DONE">DONE</span> 对接商户网管 0.5d</h4>
<div class="outline-text-4" id="text-16-3-1">
</div>
</div>
<div id="outline-container-org9a19e0a" class="outline-4">
<h4 id="org9a19e0a"><span class="section-number-4">16.3.2</span> <span class="todo TODO">TODO</span> 对接商户网管内网</h4>
</div>
<div id="outline-container-orgb54ec54" class="outline-4">
<h4 id="orgb54ec54"><span class="section-number-4">16.3.3</span> <span class="todo TODO">TODO</span> 「商户」替换合作方 1.5d</h4>
<div class="outline-text-4" id="text-16-3-3">
</div>
<ol class="org-ol">
<li><a id="orgad3bf4e"></a><span class="todo TODO">TODO</span> remix 需要良友提供 python 包<br /></li>
<li><a id="org5d6c5cd"></a><span class="todo TODO">TODO</span> education 还差 filling form<br /></li>
</ol>
</div>
<div id="outline-container-org0b1672d" class="outline-4">
<h4 id="org0b1672d"><span class="section-number-4">16.3.4</span> <span class="todo TODO">TODO</span> 后台接口（验证，列表） 1d</h4>
</div>
</div>
<div id="outline-container-org3fc80ad" class="outline-3">
<h3 id="org3fc80ad"><span class="section-number-3">16.4</span> <span class="todo TODO">TODO</span> 联调 2d</h3>
</div>
</div>

<div id="outline-container-orgd40e5a2" class="outline-2">
<h2 id="orgd40e5a2"><span class="section-number-2">17</span> <span class="todo TODO">TODO</span> 业务指标监控</h2>
</div>
<div id="outline-container-org658eb7b" class="outline-2">
<h2 id="org658eb7b"><span class="section-number-2">18</span> <span class="done DONE">DONE</span> 分类+合作方名称</h2>
<div class="outline-text-2" id="text-18">
</div>
</div>
<div id="outline-container-orgb31d4bb" class="outline-2">
<h2 id="orgb31d4bb"><span class="section-number-2">19</span> <span class="todo TODO">TODO</span> 白板调研</h2>
<div class="outline-text-2" id="text-19">
<p>
功能点：
</p>
<ul class="org-ul">
<li>互动涂鸦： 多用户同时涂鸦</li>
<li>轨迹实时同步</li>
<li>文档共享</li>
<li>媒体共享</li>
<li>文档转码</li>
<li>白板与音视频实时同步录制： 同步录制</li>
<li>回放功能</li>
</ul>

<p>
白板就是图片上支持涂鸦而已
<a href="https://www.write-bug.com/article/1514.html">https://www.write-bug.com/article/1514.html</a>
</p>

<p>
关键词：共享白板，网络电子白板
</p>

<p>
将图形进行矢量序列化处理
</p>

<p>
链表管理多个客户端socket
</p>

<p>
每种绘图工具创建一个数组保存特征值
</p>

<p>
socket listen &#x2013;&gt; 存档 &#x2013;&gt; 反序列化 &#x2013;&gt; 图形
</p>


<p>
图片模式，点阵模式
把电子白板分成不同的点阵区间，而后建立一个画图的数据链表，我们在电子白板上进行绘画的时候，把其画的点的位置写到这个数据链表里面，在这个链表里面
当操作者进行完一次操作的时候，其数据链表更新并传输一次，接收者接收到数据链表后，对这些数据进行还原，并重绘数据，这样就可以实时还原操作者的数据。
<a href="http://www.zoomus.com.cn/article/20181110000050.html">http://www.zoomus.com.cn/article/20181110000050.html</a>
</p>


<p>
一致性和容错性
</p>

<p>
光标样式同步 optional
</p>


<p>
TCP or SCTP 
<a href="https://juejin.im/post/5c9cbbb85188251c3a2f36e8">https://juejin.im/post/5c9cbbb85188251c3a2f36e8</a>
</p>

<p>
websocket 实现
<a href="http://blog.bfw.wiki/user1/15828953466520870044.html">http://blog.bfw.wiki/user1/15828953466520870044.html</a>
</p>

<p>
回放，这篇文章讲的好
<a href="https://zhuanlan.zhihu.com/p/73652727">https://zhuanlan.zhihu.com/p/73652727</a>
</p>

<p>
<a href="https://github.com/FE-Kits/web-whiteboard">https://github.com/FE-Kits/web-whiteboard</a>
</p>


<ul class="org-ul">
<li>服务端
<ol class="org-ol">
<li>存储(录制)</li>
<li>长连接管理</li>
<li>扩散写</li>
<li>定时发送(回放)</li>
</ol></li>

<li>前端/客户端
<ol class="org-ol">
<li>画板</li>
<li>sync</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
